# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   6  15  14   8   1
1  16   4  18  16  12
2  13  13   7  10  11
3   3   4  18   6  18
4   2  17  12   9  15

# Akses nilai variabel pada query()

In [5]:
df.query('A > 10')

    A   B   C   D   E
1  16   4  18  16  12
2  13  13   7  10  11

In [7]:
rerata = df['A'].mean()
rerata

8.0

In [9]:
df.query('A > @rerata')

    A   B   C   D   E
1  16   4  18  16  12
2  13  13   7  10  11